In [1]:
import pandas as pd

In [9]:
df = pd.read_excel("Dataset/Train.xlsx")

In [10]:
df.head()

,TYPE,HUNDRED_BLOCK,NEIGHBOURHOOD,X,Y,Latitude,Longitude,HOUR,MINUTE,YEAR,MONTH,DAY,Date
0,Other Theft,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,16.0,15.0,1999,5,12,1999-05-12
1,Other Theft,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,15.0,20.0,1999,5,7,1999-05-07
2,Other Theft,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,16.0,40.0,1999,4,23,1999-04-23
3,Other Theft,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,11.0,15.0,1999,4,20,1999-04-20
4,Other Theft,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,17.0,45.0,1999,4,12,1999-04-12

In [11]:
df.columns

Index(['TYPE', 'HUNDRED_BLOCK', 'NEIGHBOURHOOD', 'X', 'Y', 'Latitude',
       'Longitude', 'HOUR', 'MINUTE', 'YEAR', 'MONTH', 'DAY', 'Date'],
      dtype='object')

In [15]:
agg_df = df.groupby(["TYPE", "YEAR", "MONTH"]).size().reset_index(name="incident_count")

In [16]:
agg_df.head()

                         TYPE  YEAR  MONTH  incident_count
0  Break and Enter Commercial  1999      1             303
1  Break and Enter Commercial  1999      2             254
2  Break and Enter Commercial  1999      3             292
3  Break and Enter Commercial  1999      4             266
4  Break and Enter Commercial  1999      5             291

In [17]:
agg_df.shape

(1404, 4)

In [24]:
df.isna().mean() * 100

TYPE              0.000000
HUNDRED_BLOCK     0.002739
NEIGHBOURHOOD    10.850147
X                 0.000000
Y                 0.000000
Latitude          0.000000
Longitude         0.000000
HOUR             10.402158
MINUTE           10.402158
YEAR              0.000000
MONTH             0.000000
DAY               0.000000
Date              0.000000
dtype: float64

In [29]:
df.groupby(["NEIGHBOURHOOD"])["TYPE"].nunique()

NEIGHBOURHOOD
Arbutus Ridge                8
Central Business District    8
Dunbar-Southlands            8
Fairview                     8
Grandview-Woodland           8
Hastings-Sunrise             8
Kensington-Cedar Cottage     8
Kerrisdale                   8
Killarney                    8
Kitsilano                    8
Marpole                      8
Mount Pleasant               8
Musqueam                     8
Oakridge                     8
Renfrew-Collingwood          8
Riley Park                   8
Shaughnessy                  8
South Cambie                 8
Stanley Park                 8
Strathcona                   8
Sunset                       8
Victoria-Fraserview          8
West End                     8
West Point Grey              8
Name: TYPE, dtype: int64

In [19]:
df.dtypes

TYPE                     object
HUNDRED_BLOCK            object
NEIGHBOURHOOD            object
X                       float64
Y                       float64
Latitude                float64
Longitude               float64
HOUR                    float64
MINUTE                  float64
YEAR                      int64
MONTH                     int64
DAY                       int64
Date             datetime64[ns]
dtype: object

In [20]:
df["TYPE"].value_counts()

TYPE
Theft from Vehicle                                      153932
Mischief                                                 63233
Break and Enter Residential/Other                        56564
Offence Against a Person                                 49365
Other Theft                                              43593
Theft of Vehicle                                         36189
Break and Enter Commercial                               30048
Theft of Bicycle                                         22110
Vehicle Collision or Pedestrian Struck (with Injury)     19531
Name: count, dtype: int64

In [21]:
df["NEIGHBOURHOOD"].value_counts()

NEIGHBOURHOOD
Central Business District    96171
West End                     36954
Fairview                     29377
Mount Pleasant               26879
Grandview-Woodland           24333
Kitsilano                    24118
Renfrew-Collingwood          24092
Kensington-Cedar Cottage     22708
Strathcona                   18281
Hastings-Sunrise             16378
Sunset                       15991
Marpole                      11836
Riley Park                   11164
Victoria-Fraserview           9883
Killarney                     9657
Oakridge                      7221
Dunbar-Southlands             7106
Kerrisdale                    6766
Arbutus Ridge                 5431
West Point Grey               5262
Shaughnessy                   4773
South Cambie                  4658
Stanley Park                  3532
Musqueam                       503
Name: count, dtype: int64

In [22]:
df["HUNDRED_BLOCK"].value_counts()

HUNDRED_BLOCK
OFFSET TO PROTECT PRIVACY    49365
7XX GRANVILLE ST              4148
6XX GRANVILLE ST              2876
7XX W GEORGIA ST              2141
X NK_LOC ST                   2113
                             ...
MCCLEERY ST / W 45TH AVE         1
19XX MACDONALD ST                1
3X E 53RD AVE                    1
83XX EAST BLVD                   1
X RUPERT ST OFRP                 1
Name: count, Length: 20566, dtype: int64

In [34]:
df.groupby(["YEAR", "MONTH"])["TYPE"].value_counts().reset_index(name="incident_count")

,YEAR,MONTH,TYPE,incident_count
0,1999,1,Theft from Vehicle,1438
1,1999,1,Break and Enter Residential/Other,644
2,1999,1,Theft of Vehicle,640
3,1999,1,Mischief,551
4,1999,1,Offence Against a Person,338
...,...,...,...,...
1399,2011,12,Offence Against a Person,280
1400,2011,12,Break and Enter Commercial,227
1401,2011,12,Theft of Vehicle,143
1402,2011,12,Vehicle Collision or Pedestrian Struck (with I...,127
1403,2011,12,Theft of Bicycle,121

In [36]:
df.groupby(["YEAR", "MONTH"])["TYPE"].nunique().reset_index()

     YEAR  MONTH  TYPE
0    1999      1     9
1    1999      2     9
2    1999      3     9
3    1999      4     9
4    1999      5     9
..    ...    ...   ...
151  2011      8     9
152  2011      9     9
153  2011     10     9
154  2011     11     9
155  2011     12     9

[156 rows x 3 columns]

In [7]:
test_df = pd.read_csv("./Dataset/Test.csv")

In [8]:
test_df.head()

,YEAR,MONTH,TYPE,Incident_Counts
0,2013,6,Vehicle Collision or Pedestrian Struck (with I...,NaN
1,2013,6,Theft of Vehicle,NaN
2,2013,6,Theft of Bicycle,NaN
3,2013,6,Theft from Vehicle,NaN
4,2013,6,Other Theft,NaN

In [37]:
test_df["YEAR"].min()

np.int64(2012)

In [38]:
test_df["YEAR"].max()

np.int64(2013)

In [41]:
test_df.groupby(["YEAR"])["MONTH"].unique()

YEAR
2012    [12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1]
2013                         [6, 5, 4, 3, 2, 1]
Name: MONTH, dtype: object

In [42]:
df["YEAR"].min()

np.int64(1999)

In [43]:
df["YEAR"].max()

np.int64(2011)

In [44]:
df.groupby(["YEAR"])["MONTH"].unique()

YEAR
1999    [5, 4, 3, 6, 2, 7, 1, 9, 11, 10, 12, 8]
2000    [10, 7, 6, 1, 2, 3, 9, 8, 4, 11, 12, 5]
2001    [6, 12, 11, 9, 8, 2, 7, 1, 5, 4, 10, 3]
2002    [8, 5, 4, 6, 1, 12, 3, 2, 11, 9, 10, 7]
2003    [4, 12, 2, 3, 1, 9, 10, 11, 6, 8, 7, 5]
2004    [10, 6, 1, 3, 5, 7, 8, 4, 9, 2, 11, 12]
2005    [1, 12, 5, 6, 7, 9, 2, 11, 8, 10, 4, 3]
2006    [1, 7, 12, 4, 6, 8, 5, 2, 10, 9, 11, 3]
2007    [6, 11, 1, 2, 3, 12, 4, 7, 9, 5, 10, 8]
2008    [10, 11, 1, 7, 5, 4, 2, 12, 9, 3, 8, 6]
2009    [6, 7, 8, 9, 10, 5, 11, 12, 4, 2, 3, 1]
2010    [12, 7, 11, 1, 2, 3, 5, 6, 4, 9, 10, 8]
2011    [2, 5, 8, 10, 9, 4, 1, 12, 3, 6, 7, 11]
Name: MONTH, dtype: object

In [46]:
df["X"].nunique()

84225

In [47]:
df["Y"].nunique()

82768

In [48]:
df.shape

(474565, 13)